---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder
source: html/089b1bd6-ea63-f98e-c3c6-3ef1277d0497.htm
---
# SchemaBuilder Methods

Checks whether a string is an acceptable name for a Schema or a Field.